
# Все задачи решать с помощью использования лямбд, filter, map, zip, enumerate, List Comprehension
# 1) Вводится список целых чисел в одну строчку через пробел. Необходимо оставить в нем только двузначные числа.
# Реализовать программу с использованием функции filter. Результат отобразить на экране в виде последовательности
# оставшихся чисел в одну строчку через пробел.
# [1,2,3,4,22,234,24] ----> [22, 24]


arr = [i for i in range(0,300,2)]
arr_num = lambda x: list(filter(lambda y:y if 100 > y > 9 and type(y) == int else None ,x))
print(arr_num(arr))